# Задача 3. Приоритет задач
# В одном дата-центре ресурсы распределены так, что сначала обрабатываются крупные задачи, а затем уже идут небольшие.
# Каждая из этих задач, по сути, просто огромный поток цифр. Ваша задача, как программиста этого центра, написать программу,
# которая поможет определять, какую из задач нужно решать в первую очередь.
# Вводится последовательность из N чисел. Нужно определить номер числа, у которого больше всего цифр,
# и вывести на экран соответствующее сообщение. Если число отрицательное, то считать его за 0.
# Для подсчёта количества цифр реализуйте функцию numeral_count.
# Пример работы программы:
# Введите кол-во задач: 4
# Введите число: 6
# Введите число: 14
# Введите число: 1
# Введите число: 13434
# Первая задача на обработку: 13434

def numeral_count(number):
    count = 0
    while number > 0:
        number //= 10
        count += 1
    return count


def numeral_check(n):
    max_count = 0
    max_number = 0
    for _ in range(1, n + 1):

        new_value = int(input("Введите число: "))
        if new_value < 0:
            new_value = 0

        cipher_count = numeral_count(new_value)
        if cipher_count > max_count:
            max_count = cipher_count
            max_number = new_value

    return max_number


how_many = int(input("Введите количество чисел: "))
print("Первая задача на обработку: ", numeral_check(how_many))