# Задача 3. Число наоборот
# Что нужно сделать
# Пользователь вводит два числа: N и K.
# Напишите программу, которая переворачивает каждое из введённых чисел,
# то есть записывает эти числа в обратном порядке.
# Пример
# Введите первое число: 102
# Введите второе число: 123
# Первое число наоборот: 201
# Второе число наоборот: 321
# Что оценивается
# Задача решена с использованием функции, которая переворачивает число.
# Результат вывода соответствует условию, а формат вывода соответствует примеру.
# Вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).
# Здесь напишите код для решения задачи 3

def reverse_number(num):
    reversed_num = 0
    while num > 0:
        digit = num % 10
        reversed_num = reversed_num * 10 + digit
        num = num // 10
    return reversed_num

N = int(input("Введите первое число: "))
K = int(input("Введите второе число: "))

reversed_N = reverse_number(N)
reversed_K = reverse_number(K)

print("Первое число наоборот:", reversed_N)
print("Второе число наоборот:", reversed_K)
