# Задача 1. Урок информатики 2
# В прошлый раз учитель написал программу, которая выводит числа в формате плавающей точки, однако он вспомнил,
# что не учёл одну важную вещь: числа-то могут идти от нуля.
# Что нужно сделать
# Задано положительное число x (x > 0). Ваша задача — преобразовать его в формат плавающей точки,
# то есть  x=a⋅10b  где 1 ≤ a < 10. Обратите внимание, что x теперь больше нуля, а не больше единицы.
# Обеспечьте контроль ввода.
# Пример 1
# Введите число: 92345
# Формат плавающей точки: x = 9.2345 * 10 ** 4
# Пример 2
# Введите число: 0.0012
# Формат плавающей точки: x = 1.2 * 10 ** -3
# Что оценивается
# Результат вывода соответствует условию.
# Обеспечен контроль ввода, обрабатываемые числа больше нуля.
# Формат вывода соответствует примеру.
# Вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).
# Здесь напишите код для решения задачи 1

number = float(input("Введите число: "))
b = 0
r = 0
if number <= 1:
  while number <= 1:
    number *= 10
    b -= 1
    r += 1

  print("Формат плавающей точки: x = ", round(number, r), "* 10 ** " + str(b))

elif number >= 10:
  while number >= 10:
    number /= 10
    b += 1

print("Формат плавающей точки: x = ", number, "* 10 ** " + str(b))