# Задача 1. Сумма чисел 2
# Пользователь вводит число N. Напишите функцию summa_n, которая принимает одно целое положительное число N
# и находит сумму всех чисел от 1 до N включительно. Функция вызывается два раза: сначала от числа N,
# а затем от полученной суммы.
# Пример работы программы:
# Введите число: 5
# Сумма от 1 до 5 = 15
# Сумма от 1 до 15 = 120

def summa_n(n_in):
    summ_out = 0
    for i in range(1, n_in + 1):
        summ_out += i
    return summ_out


n = int(input("Введите число N: "))
next_n = summa_n(n)
print("Сумма от 1 до", n, "=", next_n)
final_result = summa_n(next_n)
print("Сумма от 1 до", next_n, "=", final_result)