# Задача 3. Точность и аккуратность
# Робот из задачи “Компьютерное зрение” правильно определяет на какой клетке стоят фигуры. Но вот беда,
# часто по вине соперника-человека фигуры стоят на доске не ровно по центру клетки, а со смещением.
# Если во время игры такое смещение станет слишком велико, то станет непонятно в какой клетке стояла фигура.
# Чтобы избежать этой ситуации нужно чтобы робот поправлял фигуры на доске, выставляя их по центру клетки.
# Модифицируйте программу “Компьютерное зрение” так, чтобы она выдавала не только номера клетки,
# в которой находится фигура но и две вещественных поправки: на сколько нужно подвинуть
# фигуру по горизонтали и вертикали для того
# чтобы она оказалась по центру своей клетки.
# Пример:
# Введите местоположение фигуры
# По горизонтали: 0.731
# По вертикали: 0.167
# Фигура находится в клетке (7, 1)
# Поправьте положение фигуры на (0.019, -0.017)

x_coord = float(input("По горизонтали: "))
y_coord = float(input("По вертикали: "))
if 0 < x_coord < 0.8 and 0 < y_coord < 0.8:
    x_number = int(x_coord * 10)
    y_number = int(y_coord * 10)
    print("Фигура находится в клетке (", x_number, ",", y_number, ")")
    center_x = x_number / 10 + 0.05
    center_y = y_number / 10 + 0.05
    delta_x = round(center_x - x_coord, 3)
    delta_y = round(center_y - y_coord, 3)
    print("Поправьте положение фигуры на (", delta_x, ",", delta_y, ")")
else:
    print("Клетки с такой координатой не существует")