# Задача 3. Индекс массы тела
# Алексей работает диетологом в частной клинике, каждый день он принимает пациентов разных возрастов
# и с разными показателями роста (в метрах) и веса (в кг). Для каждого человека ему нужно считать индекс массы тела -
# это вес поделить на рост в квадрате. По государственным стандартам индекс округляется до двух знаков после точки.
# Затем по этому индексу определяется, всё ли в порядке у человека с массой тела: если до 18.5,
# то недобор; до 25 - всё нормально,
# до 30 уже идёт избыток, а после 30 - ожирение. Напишите такую программу для Алексея.

user_weight = float(input("Вес пациента: "))
user_height = float(input("Рост пациента: "))

result = round(user_weight/user_height**2, 2)
if result < 18.5:
    print("Недобор")
elif result < 25:
    print("Норма")
elif result < 30:
    print("Избыток")
else:
    print("Ожирение")