# Задача 2. День рождения
#
# В честь дня рождения сына отец не придумал ничего лучше, кроме как подарить денег. Зато он придумал хоть и странную,
# но интересную формулу, по которой высчитывается сколько он подарит:
# возраст сына умножается на 1.5 и на его температуру тела.
# Остаётся только позавидовать такой фантазии.
# Напишите программу, которая запрашивает у пользователя возраст (целое число) и температуру тела (вещественное число)
# и в результате выводит сколько отец подарит сыну денег на день рождения.

user_age = int(input("Ваш возраст? "))
user_temperature = float(input("Ваша температура тела? "))
formula_for_money = user_age * 1.5 * user_temperature
print(round(formula_for_money, 2))