# Задача 2. Вот это объёмы
# Андрей продолжает писать курсовую работу по физике, и теперь ему нужно находить не только объём планеты, но и её площадь.
# Для этого он использует две такие формулы:
# Формула для площади сферы:
# Формула для объёма шара:
# Так как в самом курсовом проекте эти формулы пригодятся ещё не раз,
# Андрей решил поступить рационально и просто написать функцию для каждой формулы.
# Напишите программу, которая на вход получает от пользователя радиус планеты (вещественное число) и вызывает функции
# sphere_area и sphere_volume Реализуйте эти функции: первая считает и выводит на экран площадь сферы,
# вторая — объём шара.
import math


def sphere_area(radius):
    print(4 * math.pi * radius ** 2)


def sphere_volume(radius):
    print(4 / 3 * math.pi * radius ** 3)


radius_of_planet = float(input("Введите радиус планеты: "))
sphere_area(radius_of_planet)
sphere_volume(radius_of_planet)