# Задача 1. Среднее арифметическое
# Программа получает от пользователя два числа — a и b.
# Реализуйте функцию, которая принимает на вход числа a и b, считает
# и выводит в консоль среднее арифметическое всех чисел из отрезка [a; b].
# Обеспечьте контроль ввода: не забывайте, что а всегда должно быть меньше, чем b.
# Пример:
# Введите левую границу: 3
# Введите правую границу: 8
# Среднее: 5.5
# Усложнение: сделайте это без использования циклов.
import math


def mean_calc(x, y):
    sum_of_numbers, count_of_numbers = 0, 0
    for i in range(x, y + 1):
        sum_of_numbers += i
        count_of_numbers += 1

    print("Среднее:", round(sum_of_numbers / count_of_numbers, 2))

    # Без цикла

    print("Среднее:", round((x + y) / 2, 2))


a = int(input("Введите a: "))
b = int(input("Введите b: "))

if a > b:
    a, b = b, a

mean_calc(a, b)
