# Задача 3. GPS-навигатор 2.0
# Нам поручили усовершенствовать GPS-навигатор, добавив в него новую фишку.
# Теперь пользователь может не только смотреть расстояние от себя до объекта,
# но и задавать в навигаторе две произвольные точки,
# после чего на экран ему выводится расстояние между ними.
# Для этого пользователь вводит четыре действительных числа x1, y1, x2, y2 —
# это как раз координаты этих двух точек.
# Напишите программу, где у пользователя спрашивается, чего он хочет — найти расстояние от себя до точки или
# найти расстояние между двумя произвольными точками, после чего запрашиваются необходимые координаты точек
# и выводится ответ на экран.
import math


def my_distance(x, y):
    distance = math.sqrt(x ** 2 + y ** 2)
    print(distance)


def their_distance(x_1, x_2, y_1, y_2):
    distance = math.sqrt((x_2 - x_1) ** 2 + (y_2 - y_1) ** 2)
    print(distance)


user_choice = int(input("Найти расстояние от себя до точки (1) "
                        "или найти расстояние между двумя произвольными точками (2)? "))
if user_choice == 1:
    target_x = float(input("Введите координату X цели: "))
    target_y = float(input("Введите координату Y цели: "))
    my_distance(target_x, target_y)
elif user_choice == 2:
    target_x_1 = float(input("Введите координату X цели 1: "))
    target_y_1 = float(input("Введите координату Y цели 1: "))
    target_x_2 = float(input("Введите координату X цели 2: "))
    target_y_2 = float(input("Введите координату Y цели 2: "))
    their_distance(target_x_1, target_x_2, target_y_1, target_y_2)
else:
    print("Ввод неверный")