

# “Проверка 'a', 'b' и 'с' "
# a = 2
# b = 5
# c = 10
# result = a + b
# print (result == c)
# print (result != c)
# print (result > c)
# print (result >= c)
# print (result < c)
# print (result <= c)
# ----------------------------------------------------------------------------------------------------------------------
# Спам
# text = 'Это спам !.'
# number = 10
# spam = text * number
# print(spam)
# ----------------------------------------------------------------------------------------------------------------------
# Площадь квадрата
# a = 5.5
# b = 7
# square = a * b
# print(square)
# print(type(square))
# ----------------------------------------------------------------------------------------------------------------------
# Расставь скобки или операторы
# a = 1
# b = 2
# c = 3
# result_1 = (a + b) / (c % b) #3.0
# result_2 = b - a - a + (c - b) # 1
# result_3 = (a - b) // (c + c) - b + a # -2
# ----------------------------------------------------------------------------------------------------------------------
# Книжный шкаф
# dracula = 'Дракула'
# golden_bowl = 'Золотая чаша'
# sunday = 'Воскресенье'
#
# print(dracula)
# print(id(dracula))
# print(golden_bowl)
# print(id(golden_bowl))
# print(sunday)
# print(id(sunday))
# ----------------------------------------------------------------------------------------------------------------------
# Опиши актера\актрису
# name = 'Мила Йолович'
# age = 47
# weight = 56
# eyws_color = 'Голубой, зеленый'
# hair_color = 'Русый'
# marital_status = 'Замужем'
#
# print(name)
# print(type(name))
# print(age)
# print(type(age))
# print(weight)
# print(type(weight))
# print(eyws_color)
# print(type(eyws_color))
# ----------------------------------------------------------------------------------------------------------------------
# Построчный разбор кода
# a = 5
# b = 3
# c = 10
# result = a - b + c
# a - b + c - выражение
# - = - оператор
# a b c result 12 - операнды
# ----------------------------------------------------------------------------------------------------------------------
# # Скорректируй данные актера\актрисы
# age = age + 2
# weight = weight - 3
# hair_color = 'Рыжий'
#
# print(age)
# print(weight)
# print(hair_color)
# ----------------------------------------------------------------------------------------------------------------------