# Задача 3. Координатные оси
# Напишите программу, которая рисует координатные оси на поле 20×50. Результат должен получиться таким:
# Что нужно поменять в коде, что в середине был не дефис, а вертикальная палочка?

x_lim = 50
y_lim = 20

for y in range(y_lim):
    for x in range(x_lim):
        if y == y_lim // 2:
            print('-', end='')
        elif x == x_lim // 2:
            print('|', end='')
        else:
            print(' ', end='')
    print()

# Вариант с вертикальной палочкой в середине:
for y in range(y_lim):
    for x in range(x_lim):
        if x == x_lim // 2:  # Ключевое отличие в порядке проверок. Если сперва выполняется проверка на дефис, то именно дефис будет выбран.
            print('|', end='')
        elif y == y_lim // 2:
            print('-', end='')
        else:
            print(' ', end='')
    print()