# Задача 2. Дорога
# Мы делаем текстовую игру — гонку, и нам нужно вывести на экран что-то вроде трассы,
# где будут соревноваться наши машины.
# Напишите программу, которая выводит такую дорогу на экран (поле 20×50).
# Что нужно сделать, чтобы обочины рисовались поверх горизонтальной линии?

x_lim = 50
y_lim = 20

delta = 3  # число 3 выбрано "на глаз", в зависимости от него дорога будет шире/уже

for y in range(y_lim):
    for x in range(x_lim):
        if y == y_lim // 2:
            print('-', end='')
        elif x == x_lim // 2:
            print('|', end='')
        elif x == x_lim // 2 - (delta + y):
            print('/', end='')
        elif x == x_lim // 2 + (delta + y):
            print('\\', end='')  # \ - символ который используется для экранирования, поэтому его пришлось дублировать
        else:
            print(' ', end='')
    print()