# Задача 2. Чёрный ящик
# Преподаватель показал студентам несколько результатов программы и сказал: «Кто догадается,
# что делает программа и как она это делает, получит зачёт автоматом».
# Студент Миша намерен получить этот зачёт. Он заметил, что в результатах программы есть определённая закономерность.
# Вот некоторые результаты:
# Напишите программу, которая запрашивает у пользователя размер матрицы и выводит соответствующие результаты.
# Подсказка: столбцы.

n = int(input("Введите число: "))
for i in range(1, n + 1):
    for j in range(1, n + 1):
        if j % 3 == 0:
            print(j, end='\t')
        else:
            print(i, end='\t')
    print()