# Задача 1. Электронная очередь
# Нам дали заказ написать программу для электронной очереди. У каждого человека в очереди есть номер:
# нулевой, первый, второй, третий и так далее. Каждый час очередь уменьшается на одного человека,
# то есть уходит сначала нулевой номер, затем первый, второй и так далее. Наша программа получает
# на вход одно число — количество людей в очереди — и выводит на экран историю обслуживания очереди:
# какие номера в какой час оставались.

human_count = int(input("Введите количество людей в очередь: "))
for human_start in range(human_count + 1):
    print("Час:", human_start)
    for human_number in range(human_start, human_count):
        print(human_number, end='\t')
    print()