# Задача 3. Успеваемость в классе
# В классе N человек. Каждый из них получил за урок по информатике три, четыре или пять, двоек сегодня не было.
# Что нужно сделать
# Напишите программу, которая получает список оценок — N чисел — и выводит на экран сообщение о том,
# кого сегодня больше: отличников, хорошистов или троечников.
# Замечание: можно предположить, что количество отличников, хорошистов и троечников различно.
# Пример
# Сколько в классе учеников? 5
# Введите оценку ученика: 3
# Введите оценку ученика: 4
# Введите оценку ученика: 4
# Введите оценку ученика: 5
# Введите оценку ученика: 4
# Сегодня больше хорошистов!
# Что оценивается
# Результат вывода соответствует условию.
# В выводе присутствует сообщение о том, кого больше.
# Для решения используется цикл for, а не встроенные функции или рекурсия.

students = int(input('Кол-во учеников: '))
perfect_count = 0
good_count = 0
normal_count = 0

for student in range(students):
    grade = int(input('Оценка очередного ученика: '))
    if grade == 5:
        perfect_count += 1
    elif grade == 4:
        good_count += 1
    elif grade == 3:
        normal_count += 1
    else:
        print('Оценка введена неверно!')

print('Отличников:', perfect_count)
print('Хорошистов:', good_count)
print('Троечников:', normal_count)

if perfect_count >= good_count and perfect_count >= normal_count:
    print('Отличников сегодня больше')
elif good_count >= perfect_count and good_count >= normal_count:
    print('Хорошистов сегодня больше')
else:
    print('Троечников сегодня больше')