# Задача 2. Сумма чисел
# Напишите программу, где пользователь вводит любые два целых положительных числа.
# А программа суммирует все числа в диапазоне от первого до второго. Гарантируется,
# что первое введённое число всегда меньше второго.
# Пример:
# Введите первое число: 5
# Введите второе число: 10
# Сумма чисел от 5 до 10 равна 45

first = int(input("Первое число: "))
second = int(input("Второе число: "))

numbers_sum = 0
for i in range(first, second + 1):  # +1 чтобы захватить второе число включительно
    numbers_sum += i
print('Сумма чисел от', first, 'до', second, 'равна', numbers_sum)