# Задача 3. Контроль температуры
# В одном из стартапов сотрудники работают над созданием системы для сбора и анализа данных с различных датчиков.
# Все показания представлены в числовом формате, но иногда значения могут повторяться.
# Датчику необходимо учитывать только уникальные температуры,
# чтобы избежать дублирования и получить корректную информацию.
# Разработайте программу, которая будет отслеживать дубликаты и немедленно оповещать сотрудников об их наличии.
# После уведомления о дубликате сотрудники должны иметь возможность решить,
# продолжать ли сбор данных или прекратить работу программы.

# Пример:
# Программа для отслеживания температуры
# Какая температура на датчике? 1
# Какая температура на датчике? 2
# Какая температура на датчике? 2
# Внимание: дублирующее значение температуры 2 обнаружено!
# Зафиксировано сбоев датчика: 1
# Хотите продолжить сбор данных? 1 — да, 0 — нет: 1
# Какая температура на датчике? 3
# Какая температура на датчике? 3
# Внимание: дублирующее значение температуры 3 обнаружено!
# Зафиксировано сбоев датчика: 2

# Хотите продолжить сбор данных? 1 — да, 0 — нет: 0
# Сбор данных остановлен.

print("Программа для отслеживания температуры")
count_failures = 0
stop_program = False
last_temperature = -999

while not stop_program:
    sensor = int(input("Какая температура на датчике? "))
    if sensor == last_temperature:
        count_failures += 1
        print("Внимание: дублирующее значение температуры", sensor, "обнаружено!")
        print("Зафиксировано сбоев датчика:", count_failures)

        continue_collecting_data = int(input("Хотите продолжить сбор данных? 1-да, 0-нет: "))
        if continue_collecting_data == 0:
            print("Сбор данных остановлен")
            stop_program = True
    last_temperature = sensor