# Задача 1. Надоедливый заказчик
# Нашему заказчику нужно, чтобы фраза «Я — программист!» выводилась на экран столько раз, сколько он сам этого захочет.
# Напишите программу, которая запрашивает число — количество строчек с фразой «Я — программист!» — и столько же раз
# выводит на экран эту фразу. Для решения задачи используйте переменную-счётчик,
# которая увеличивается на единицу до тех пор, пока не будет выведено нужное количество строчек.

phrase_count = 0
need_count = int(input("Сколько раз вывести фразу? "))
while phrase_count < need_count:
    print("Я — программист!")
    phrase_count += 1

