# Задача 3. Реставрация книг
# На летней практике в библиотеке школьникам дают возможность помочь сохранить редкие и старинные книги: многие из них, особенно те, что содержат иллюстрации, со временем повреждаются. Библиотека решила поручить школьникам важную задачу — найти такие книги и передать их библиотекарю для реставрации.
# Каждому ученику нужно найти пять книг, которые требуют восстановления. Поскольку количество доступных для проверки книг в день ограничено, не всегда удастся завершить отработку за один день, и ученикам, возможно, придётся продолжить проверку на следующий.
# Напишите программу, которая будет помогать отслеживать количество найденных книг для реставрации. Библиотекарь выдаёт ученику некоторое количество книг для проверки. Программа запрашивает у ученика, сколько книг он посмотрел и сколько из них требует реставрации. Если ученик нашёл пять книг, программа выводит сообщение о завершении практики. Если цель ученика не выполнена, программа сообщает, что придётся прийти на практику ещё раз.


# Пример 1:
# Сколько книг выдал библиотекарь? 10
# Сколько книг просмотрено? 2
# Сколько из них требует реставрации? 1
# Сколько книг просмотрено? 6
# Сколько из них требует реставрации? 3
# Сколько книг просмотрено? 2
# Сколько из них требует реставрации? 1


# Библиотекарь: На сегодня всё. Благодарю за помощь!
# Ура! Практика завершена!


# Пример 2:
# Сколько книг выдал библиотекарь? 5
# Сколько книг просмотрено? 2
# Сколько из них требует реставрации? 0
# Сколько книг просмотрено? 2
# Сколько из них требует реставрации? 2
# Сколько книг просмотрено? 1
# Сколько из них требует реставрации? 1
# Библиотекарь: На сегодня всё. Благодарю за помощь!
# Цель практики ещё не достигнута — встретимся завтра.


total_book = int(input("Сколько книг выдал библиотекарь? "))
count_damaged_books = 0
while count_damaged_books < 5 and total_book > 0:
    books_viewed = int(input("Сколько книг просмотрел? "))
    total_book -= books_viewed
    damaged_books = int(input("Сколько из них было испорчено? "))
    count_damaged_books += damaged_books
print("Библиотекарь: На сегодня всё. Благодарю за помощь!")
if count_damaged_books >= 5:
   print("Ура! Практика завершена!")
else:
   print("Цель практики ещё не достигнута — встретимся завтра.")
