# Задача 2. Тестируем приложение
#
# Напишите программу, которая имитирует работу с приложением: программа спрашивает у пользователя «Продолжаем работать? 1/0: » до тех пор,
# пока пользователь не введёт 0, — после этого выводится сообщение: «Приложение закрывается…». В конце программы также выводится сообщение:
# «Работа завершена». Для создания бесконечного цикла используйте while True.
#
#
#


while True:
    is_working = int(input("Продолжаем работать? 1/0: "))
    if is_working == 0:
        print("Приложение закрывается…")
        break

print("Работа завершена")

# Решение так же может быть другим, например:
is_working = 1
while is_working:
    is_working = int(input("Продолжаем работать? 1/0: "))

print("Работа завершена")