# Задача 2. Начальник
# Напишите программу для робота-начальника. Он спрашивает у пользователя, выполнил ли он задание,
# которые выдавал вчера,
# и продолжает это делать до тех пор, пока тот не ответит ему “Да, конечно, сделал”.

break_answer = "Да, конечно, сделал"

while True:
    user_input = input("Выполнил задание? ")
    if user_input == break_answer:
        break

# Альтернативный вариант:

break_answer = "Да, конечно, сделал"
user_input = ""
while break_answer != user_input:
    user_input = input("Выполнил задание? ")
    