# Задача 2. Локальная сеть
# У Никиты дома есть много компьютеров, которые он хочет подключить к одной локальной сети.
# Для этого ему нужно сгенерировать айпи адрес для каждого компьютера.
# Айпи адрес записывается как 4 числа, которые отделяются точкой. Не долго думая,
# для генерации Никита решил использовать
# арифметическую прогрессию, причём первые 3 числа в адресе - это члены прогрессии, а последнее число - это её сумма.
# Напишите программу, где пользователь вводит:
# Первый член прогрессии.
# Разность (шаг, с которым будут увеличиваться числа).
# И в результате получает IP-адрес.

first_elem = int(input("Введите первый элемент: "))
delta = int(input("Введите разность: "))
print(first_elem, end='.')
last_sum = first_elem
for _ in range(2):
    first_elem += delta
    last_sum += first_elem
    print(first_elem, end='.')
print(last_sum)
