# Задача 1. Урок литературы
# Выполните задание, разобранное в уроке.
# К уроку литературы нужно было прочитать “Евгения Онегина”. Учитель задаёт вопрос пяти случайным детям.
# Она задаёт вопрос
# “Кто написал произведение?” и если ученик не угадывает, то учитель ставит двойку и спрашивает следующего.
# Если хоть кто-то угадает,
# то вопросы больше не задаются. Напишите программу, которая посчитает количество двоечников из этих пяти.

right_answer = "Пушкин"
loser_count = 0
for _ in range(5):
    student_answer = input("Кто написал произведение?")
    if student_answer == right_answer:
        break
    print("Ставим двойку! Неси дневник!")
    loser_count += 1

print("Двоечников: ", loser_count)