# Задача 2. Вирус
# Ваня экспериментирует с различного рода компьютерными вирусами, которые портят жизнь людям.
# На просторах Интернета он нашёл код довольно необычного вируса, который каждый символ в документе повторяет 3 раза.
# Пользователь вводит текст. Напишите программу, которая выводит каждый символ текста в отдельной строке и три раза.
# Пример:
# Введите текст: Привет!
# ППП
# ррр
# иии
# ввв
# еее
# ттт
# !!!

phrase_in = input("Введите текст: ")
for symbol in phrase_in:
    print(symbol * 3)
