# Задача 1. «Я стал новым пиратом!»
# Старому капитану нужно пополнить команду, но на корабль попадут только достойные.
# Он отобрал десять человек. Те, кто крикнет слово «Карамба», попадут на борт.
# Что нужно сделать
# Пользователь вводит десять слов. Напишите программу, которая определяет,
# сколько из них совпадают со словом «Карамба».
# Что оценивается
# Результат вывода соответствует условию.
# Программа игнорирует регистр первой буквы К.

caramba_cnt = 0

for i_word in range(10):
    word = input('Какое слово крикнуть? ')
    if word == 'Карамба' or word == 'карамба':
        caramba_cnt += 1

print('На корабль отобрано', caramba_cnt, 'человек!')