# Задача 2. Шаг в прошлое
# Напишите программу, которая выводит каждый второй год в обратном порядке,
# начиная с указанного пользователем года и до 1900 включительно.
# Если введённый год меньше 1900, программа должна вывести сообщение: «Год должен быть не меньше 1900».
# Пример 1:
# Введите год (не меньше 1900): 2024
# 2024
# 2022
# 2020
# ...
# 1902
# 1900
# Пример 2:
# Введите год (не меньше 1900): 1880
# Год должен быть не меньше 1900

start_year = int(input("Введите год (не меньше 1900): "))

if start_year < 1900:
    print("Год должен быть не меньше 1900")
else:
    for year in range(start_year, 1899, -2):  # 1899, чтобы включить 1900
        print(year)