# Задача 3. Диета
# Саша просыпается когда угодно, но в 23 часа уже точно идёт спать.
# Питается Саша следующим образом: каждые 3 часа он выпивает литр воды и съедает N калорий.
# Пить и есть он, кстати, начинает сразу как только проснётся.
# Напишите программу, которая считает сколько он выпьет литров воды
# и сколько калорий он съест перед тем как пойдёт спать.

hour_start = int(input("Когда проснулся Саша? "))
water = 0
food = 0
for hour in range(hour_start, 23, 3):
    water += 1
    food_eaten = int(input("Сколько еды за раз съел? "))
    food += food_eaten
print("Еды съедено:", food, "Воды выпито:", water)