# Задача 2. Деление клетки
# Реализуйте программу, разобранную на видео.
# В одной лаборатории наблюдают за одноклеточной амёбой. Мы знаем, что каждые три часа она делится на 2 клетки.
# Нам нужно для этой лаборатории написать программу, которая будет выводить сколько прошло часов и сколько получилось клеток.
# Также нас попросили писать на каждом этапе деления сколько осталось часов до завершения наблюдения,
# чтобы ученым было проще формулировать выводы на определённом этапе наблюдения.
# Пример сообщений:
# Прошло часов: 3.
# Клеток: 2.
# Часов до конца эксперимента: 12
# Прошло часов: 6...

total_hours = int(input("Количество часов: "))
cell_count = 1
for hour in range(1, total_hours // 3 + 1):
    cell_count *= 2
    print("Прошло часов:", hour * 3)
    print("Количество клеток:", cell_count)
    print("Осталось часов:", total_hours - hour * 3)
print("Наблюдение завершено!")